{
  "dispensary": {
    "name": "Flower Montana - Kalispell",
    "address1": "1440 Highway 25",
    "coverPhotoUrl": "https://leafly-public.imgix.net/dispensary/photos/gallery300134/3ZO2DDFoR6SKis8l29te_New-Flower-Logo_Large.jpg",
    "country": "US",
    "city": "Kalispell",
    "description": "Kalispell Flower Dispensary is located near the intersection of Hwy 35 and Hwy 2 in Kalispell, MT in the heart of the Flathead Valley. We are centrally located between Glacier Park, Bigfork, Kalispell, Columbia Falls, and Whitefish!  At Flower, we are known for our excellent prices, and we set the bar for quality within the Montana Cannabis Industry. \n\nOPEN 7 DAYS A WEEK!\n\nQUALITY PRODUCTS\nLooking for shatter? \nWe have the blondest, highest-testing around. The quality is outstanding!\n\nFlower? \nWe carry a wide variety (up to 14 strains) on the shelf at any time and are regularly rotating the menu to always give you something new to look forward to. You will never get bored with the cut-only selection we grow, and we are always investing in the newest, hottest strains hitting other states/stores.\n\nGrab-n-go\nOur pre-rolls are perfectly packed, beautifully packaged, and just better than the rest (we use real flower-  not just shake- for these bad boys)! Not to mention, at $5/gram, you won't find a cheaper deal.\n\nDistillate pens? \nWe've got everything you could ever want! Single-use pods, jupiter c-cell powered .5g and full gram pen tips, THC/CBD ratio pens, terp pens... and the taste is out of this world!\n\nThe list goes on and on... tinctures, capsules, topicals, edibles (we have SO MANY AMAZING EDIBLES)! You cannot go wrong with a single item. Hand-crafted by the best to be the best.\n\nWHO ARE WE?\nAt Flower, we have always prided ourselves in cannabis advocacy. We believe in a professional, tasteful approach, and you can always expect a clean, welcoming atmosphere when you swing by. \nWe are highly engaged with the state legislature and are always voicing the needs of medical patients, recreational users, and small mom-and-pop business entrepreneurs like ourselves. \n\nMEDICAL PATIENTS\nLet us connect you with a doctor for your medical card!\nWe can process your medical patient new/renewal paperwork for you!\n\nWant to learn more? \nOur budtenders are highly trained to help you find the products best for you. Everyone has different tastes and likes, and we are excellent at helping you discover the items that give you the therapy you're looking for.\n",
    "email": "flatheadflower@flowermontana.com",
    "flags": [
      "US",
      "adaAccessible",
      "atm",
      "dispensary",
      "licensed",
      "medical",
      "parkingAvailable",
      "recreational",
      "storefront",
      "womanOwned"
    ],
    "locations": [
      {
        "lat": 48.1919889,
        "lon": -114.3168131
      },
      {
        "lat": 48.2056762,
        "lon": -114.2966844
      }
    ],
    "logoUrl": "https://leafly-public.imgix.net/dispensary/photos/gallery300134/2G8QFgzTR6atn2QV8wAS_New-Flower-Lotus-Mark-Large.jpg",
    "mapMarkerLocations": [
      {
        "city": "Kalispell",
        "index": 0,
        "label": "Kalispell, MT",
        "state": "MT",
        "country": "United States",
        "latitude": 48.2056762,
        "longitude": -114.2966844
      }
    ],
    "phone": "(406) 541-0420",
    "photos": [
      {
        "id": -1,
        "imageUrl": "https://leafly-public.imgix.net/dispensary/photos/gallery300134/3ZO2DDFoR6SKis8l29te_New-Flower-Logo_Large.jpg"
      }
    ],
    "primaryLocation": {
      "lat": 48.1919889,
      "lon": -114.3168131
    },
    "state": "MT",
    "tags": [
      "storefront",
      "recreational",
      "licensed",
      "medical"
    ],
    "website": "",
    "zip": "59901"
  },
  "products": []
}